# turtle graphics

In [ ]:
import turtle as t
a1 = t.Turtle()
a1.pencolor('violet')
for i in range(40):
    a1.forward(i * 10)
    a1.left(144)
t.done()

In [ ]:
# spiral square
import turtle as t
a1 = t.Turtle()
for i in range(500):
    a1.fd(i)
    a1.right(95)
a1.done()

In [ ]:

from turtle import *
bgcolor('black')
pencolor('green')
colors = ['blue','green','yellow','red','purple','orange']
for i in range(360):
    pencolor(colors[i%6])
    width(i/100 + 1)
    bk(i)
    left(59)

In [ ]:
from turtle import *
pensize(3)
pencolor('green')
for i in range(15):
    circle(10*i)

In [ ]:
from turtle import *
pensize(3)
pencolor('green')
for i in range(150):
    circle(10+i,45)

In [ ]:
from turtle import *
speed(0)
pensize(6)
r1 = ["blue","black","red"]
for i in range(3):
    penup()
    pencolor(r1[i%3])
    goto(i*100,0)
    pendown()
    circle(50)
r2 = ["","yellow","","green"]
for i in range(1,4,2):
    penup()
    pencolor(r2[i])
    goto(i*55,-55)
    pendown()
    circle(50)

In [ ]:
from turtle import *
bgcolor('green')
color('#2B28F6')
penup()
goto(0,0)
begin_fill()
fd(570)
left(90)
fd(80)
left(90)
fd(570)
left(90)
fd(80)
end_fill()
# roof
pensize(6)
penup()
goto(100,50)
pendown()
setheading(45)
forward(100)
setheading(0)
forward(250)
setheading(-45)
forward(100)
setheading(90)
penup()
goto(300,50)
pendown()
forward(75)
# wheels
penup()
goto(200,-10)
pendown()
color('black')
fillcolor('brown')
begin_fill()
circle(25)
end_fill()
penup()
goto(400,-10)
pendown()
color('black')
fillcolor('brown')
begin_fill()
circle(25)
end_fill()

# IDIOMATIC PYTHON
- TRANSFORMATION OF CODE INTO BEAUTIFUL IDIOMATIC PYTHON
- replaces

In [1]:
li = [0,1,2,3,4,5]
for i in [0,1,2,3,4,5]:
    print(i ** 2,end='')
    
print()
for i in range(6):
    print(li[i],end='')

01491625
012345

In [2]:
li = [1,2,3,4,5]
for i in range(len(li)):
    print(li[i],end='')
print()
for i in li:
    print(i,end=' ')

12345
1 2 3 4 5

In [4]:
# looping from backward direction
li = [1,2,3,4,5]
for i in range(len(li)-1,-1,-1):
    print(li[i],end='')
print()
for i in reversed(li):
    print(i,end=' ')

54321
5 4 3 2 1

In [5]:
# looping over the collection with index
li = [1,2,3,4,5]
for i in range(len(li)):
    print(i,'-->',li[i])
print()
for i,a in enumerate(li):
    print(i,'-->',a)

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

In [7]:
#looping over two collection
li = [1,2,3,4,5]
a = [1,2,3,4,5,6,8]
n = min(len(li),len(a))
for i in range(n):
    print(li[i],' ',a[i])
print()
for i,a in zip(li,a):
    print(i,' ',a)

1   1
2   2
3   3
4   4
5   5

1   1
2   2
3   3
4   4
5   5

In [8]:
# sorted order
li = [4,2,3,1,5]
for i in sorted(li):
    print(i,end='')
print()
for i in sorted(li,reverse=True):
    print(i,end=' ')

12345
5 4 3 2 1

In [11]:
# list comprehension
# traditional approach
li = []
for i in range(10):
    a = i ** 2
    li.append(a)
print(sum(li))
print()
print(sum(i**2 for i in range(10)))

285

285

# Lambda Functions
- anonymous functions means that a fun is without a name
- any lambda fun on python will be defined with lambda
- syntax : lambda arg : expressions

In [12]:
def square(n):
    return n*n
square(10)

100

In [13]:
a = lambda x : x*x
print(a(10))

100

# use of lambda with filter

In [15]:
def filterlist(li):
    a = []
    for i in li:
        if i % 2 == 0:
            a.append(i)
    return a
li = [1,2,3,4,5,6,7,8]
filterlist(li)

[2, 4, 6, 8]

In [16]:
li = [1,2,3,4,5,6,7,8]
lam_li = list(filter(lambda x : (x%2==0),li))
print(lam_li)

[2, 4, 6, 8]

In [ ]:
# lambda with map()

In [17]:
def squarelist(li):
    a = []
    for i in li:
        a.append(i*2)
    return a
li = [1,2,3,4,5,6,7,8]
squarelist(li)

[2, 4, 6, 8, 10, 12, 14, 16]

In [18]:
li = [1,2,3,4,5,6,7,8]
map_list = list(map(lambda x : x*2,li))
print(map_list)

[2, 4, 6, 8, 10, 12, 14, 16]

In [19]:
def sumlist(li):
    s = 0
    for i in li:
        s += i
    return s
li = [1,2,3,4,5,6,7,8]
sumlist(li)

36

In [20]:
from functools import reduce
li = [1,2,3,4,5,6,7,8]
s = reduce((lambda x,y:x+y),li)
print(s)

36

# standard package
# pandas,Numpy,Matplotib

# pandas
- data cleaning
- data transformation
- data analysis
# Notations
- series
- data frames

In [5]:
import pandas as pd
internal1 = {'s1':35,'s2':35,'s3':35}
internal2 = {'s1':35,'s2':35,'s3':35}
internal1 = pd.Series(internal1)
internal2 = pd.Series(internal2)
print(internal1)
print(internal2)

s1    35
s2    35
s3    35
dtype: int64
s1    35
s2    35
s3    35
dtype: int64

In [6]:
final = {'internal1':internal1,'internal2':internal2}
final = pd.DataFrame(final)
print(final)
print(type(final))

    internal1  internal2
s1         35         35
s2         35         35
s3         35         35
<class 'pandas.core.frame.DataFrame'>

In [7]:
final.columns

Index(['internal1', 'internal2'], dtype='object')

In [8]:
final.values

array([[35, 35],
       [35, 35],
       [35, 35]], dtype=int64)

In [8]:
final.values[1]

array([35, 35], dtype=int64)

In [9]:
final.values[2][0]

35

In [10]:
final.values

array([[35, 35],
       [35, 35],
       [35, 35]], dtype=int64)

In [10]:
for row in final.values:
    print('internal1 - ',row[0],'internal2 - ',row[1])

internal1 -  35 internal2 -  35
internal1 -  35 internal2 -  35
internal1 -  35 internal2 -  35

In [11]:
final.loc['s4'] = [20,18]
final

    internal1  internal2
s1         35         35
s2         35         35
s3         35         35
s4         20         18

In [12]:
final.values[3] = [100,410]
final

    internal1  internal2
s1         35         35
s2         35         35
s3         35         35
s4        100        410

In [13]:
pwd

'C:\\Users\\vinee'

In [14]:
filepath = 'DataFiles/Income.csv'
def readCsVData(filepath):
    return pd.read_csv(filepath)
readCsVData(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [15]:
# Extract income of all states in your 2013
# Alabama
filepath = 'DataFiles/Income.csv'
def readCsVData(filepath):
    return pd.read_csv(filepath)
df = readCsVData(filepath)
print(df)

       GEOID       State   2005   2006   2007   2008   2009   2010   2011  \
0  04000US01     Alabama  37150  37952  42212  44476  39980  40933  42590
1  04000US02      Alaska  55891  56418  62993  63989  61604  57848  57431
2  04000US04     Arizona  45245  46657  62993  46914  45739  46896  48621
3  04000US05    Arkansas  36658  37057  40795  39586  36538  38587  41302
4  04000US06  California  51755  55319  55734  57014  56134  54283  53367

    2012   2013
0  43464  41381
1  63648  61137
2  47044  50602
3  39018  39919
4  57020  57528

In [16]:
for row in df.values:
    print(row[1], ' : ',row[-1])

Alabama  :  41381
Alaska  :  61137
Arizona  :  50602
Arkansas  :  39919
California  :  57528

In [17]:
print(df.values)

[['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
  41381]
 ['04000US02' 'Alaska' 55891 56418 62993 63989 61604 57848 57431 63648
  61137]
 ['04000US04' 'Arizona' 45245 46657 62993 46914 45739 46896 48621 47044
  50602]
 ['04000US05' 'Arkansas' 36658 37057 40795 39586 36538 38587 41302 39018
  39919]
 ['04000US06' 'California' 51755 55319 55734 57014 56134 54283 53367
  57020 57528]]

In [18]:
# Average of income of California
def avgofstate():
    s = 0
    for i in range(2,11):
        s += df.values[4][i]
    return s // len(df.values[2][2:])
avgofstate()

55350

In [22]:
def printdataframecol(df):
    li = []
    columns = df.columns
    for i in columns:
        li.append(i)
    return li
printdataframecol(df)

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [27]:
filepath = 'DataFiles/RegularSeasonCompactResults.csv'
def readCsvData(filepath):
    return pd.read_csv(filepath)
df = readCsvData(filepath)

In [28]:
df.shape

(145289, 8)

In [29]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [30]:
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [31]:
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [32]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [33]:
df.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [35]:
df['Lteam'].max()
print(df['Lteam'].min())

1101

In [40]:
df.iloc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [41]:
df.loc[:-3]

Empty DataFrame
Columns: [Season, Daynum, Wteam, Wscore, Lteam, Lscore, Wloc, Numot]
Index: []

In [42]:
df.sort_values('Lscore').tail()6

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
77873    2003     110   1383     142   1254     140    H      2
24970    1991      68   1258     186   1109     140    H      0
22074    1990      96   1261     148   1258     141    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0

In [43]:
df.sort_values('Lscore').head()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027    2008      66   1203      49   1387      20    H      0
49310     1997      66   1157      61   1204      21    H      0
89021     2006      44   1284      41   1343      21    A      0
85042     2005      66   1131      73   1216      22    H      0
103660    2009      26   1326      59   1359      22    H      0

In [44]:
df[df['Wscore']>150]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269     1986      75   1258     151   1109     107    H      0
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
16040    1989      40   1328     152   1331     122    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
19971    1990      38   1258     152   1109     137    A      0
20022    1990      40   1116     166   1109     101    H      0
22145    1990      97   1258     157   1362     115    H      0
23582    1991      26   1318     152   1258     123    N      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0
25656    1991      84   1106     151   1212      97    H      0
28687    1992      54   1261     159   1319      86    H      0
35023    1993     112   1380     155   1341      91    A      0
40060    1995      32   1375     156   1341     114    H      0
52600    1998      33   1395     153   1410      87    H      0

In [46]:
df[(df['Wscore']>170) & (df['Daynum']>60)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
24970    1991      68   1258     186   1109     140    H      0